# Минское метро
MinskSubway = {"КАМЕННАЯ ГОРКА":
                   ["КУНЦАЎШЧЫНА"],
               "КУНЦАЎШЧЫНА":
                   ["КАМЕННАЯ ГОРКА",
                    "СПАРТЫЎНАЯ"],
               "СПАРТЫЎНАЯ":
                   ["КУНЦАЎШЧЫНА",
                    "ПУШКІНСКАЯ"],
               "ПУШКІНСКАЯ":
                   ["СПАРТЫЎНАЯ",
                    "МАЛАДЗЁЖНАЯ"],
               "МАЛАДЗЁЖНАЯ":
                   ["ПУШКІНСКАЯ",
                    "ФРУНЗЕНСКАЯ"],
               "ФРУНЗЕНСКАЯ":
                   ["МАЛАДЗЁЖНАЯ",
                    "НЯМІГА",
                    "ЮБІЛЕЙНАЯ ПЛОШЧА"],
               "НЯМІГА":
                   ["ФРУНЗЕНСКАЯ",
                    "КУПАЛАЎСКАЯ"],
               "КУПАЛАЎСКАЯ":
                   ["НЯМІГА",
                    "ПЕРШАМАЙСКАЯ",
                    "КАСТРЫЧНІЦКАЯ"],
               "ПЕРШАМАЙСКАЯ":
                   ["КУПАЛАЎСКАЯ",
                    "ПРАЛЕТАРСКАЯ"],
               "ПРАЛЕТАРСКАЯ":
                   ["ПЕРШАМАЙСКАЯ",
                    "ТРАКТАРНЫ ЗАВОД"],
               "ТРАКТАРНЫ ЗАВОД":
                   ["ПРАЛЕТАРСКАЯ",
                    "ПАРТЫЗАНСКАЯ"],
               "ПАРТЫЗАНСКАЯ":
                   ["ТРАКТАРНЫ ЗАВОД",
                    "АЎТАЗАВОДСКАЯ"],
               "АЎТАЗАВОДСКАЯ":
                   ["ПАРТЫЗАНСКАЯ",
                    "МАГІЛЁЎСКАЯ"],
               "ЮБІЛЕЙНАЯ ПЛОШЧА":
                   ["ФРУНЗЕНСКАЯ",
                    "ПЛОШЧА ФРАНЦІШКА БАГУШЭВІЧА"],
               "ПЛОШЧА ФРАНЦІШКА БАГУШЭВІЧА":
                   ["ЮБІЛЕЙНАЯ ПЛОШЧА",
                    "ВАКЗАЛЬНАЯ"],
               "ВАКЗАЛЬНАЯ":
                   ["ПЛОШЧА ФРАНЦІШКА БАГУШЭВІЧА",
                    "КАВАЛЬСКАЯ СЛАБАДА"],
               "УРУЧЧА":
                   ["БАРЫСАЎСКІ ТРАКТ"],
               "БАРЫСАЎСКІ ТРАКТ":
                   ["УРУЧЧА",
                    "УСХОД"],
               "УСХОД":
                   ["БАРЫСАЎСКІ ТРАКТ",
                    "МАСКОЎСКАЯ"],
               "МАСКОЎСКАЯ":
                   ["БАРЫСАЎСКІ ТРАКТ",
                    "ПАРК ЧАЛЮСКІНЦАЎ"],
               "ПАРК ЧАЛЮСКІНЦАЎ":
                   ["МАСКОЎСКАЯ",
                    "АКАДЭМІЯ НАВУК"],
               "АКАДЭМІЯ НАВУК":
                   ["ПАРК ЧАЛЮСКІНЦАЎ",
                    "ПЛОШЧА ЯКУБА КОЛАСА"],
               "ПЛОШЧА ЯКУБА КОЛАСА":
                   ["АКАДЭМІЯ НАВУК",
                    "ПЛОШЧА ПЕРАМОГІ"],
               "ПЛОШЧА ПЕРАМОГІ":
                   ["ПЛОШЧА ЯКУБА КОЛАСА",
                    "КАСТРЫЧНІЦКАЯ"],
               "КАСТРЫЧНІЦКАЯ":
                   ["ПЛОШЧА ПЕРАМОГІ",
                    "ПЛОШЧА ЛЕНІНА",
                    "КУПАЛАЎСКАЯ"],
               "ПЛОШЧА ЛЕНІНА":
                   ["КАСТРЫЧНІЦКАЯ",
                    "ІНСТЫТУТ КУЛЬТУРЫ",
                    "ВАКЗАЛЬНАЯ"],
               "ІНСТЫТУТ КУЛЬТУРЫ":
                   ["ПЛОШЧА ЛЕНІНА",
                    "ГРУШАЎКА"],
               "ГРУШАЎКА":
                   ["ІНСТЫТУТ КУЛЬТУРЫ",
                    "МІХАЛОВА"],
               "МІХАЛОВА":
                   ["ГРУШАЎКА",
                    "ПЯТРОЎШЧЫНА"],
               "ПЯТРОЎШЧЫНА":
                   ["МІХАЛОВА",
                    "МАЛІНАЎКА"],
               "МАЛІНАЎКА":
                   ["ПЯТРОЎШЧЫНА"]}

# def find_shortest_path(start, end):
